import "./App.css";
import ButtonHello from "./conponents/button_hello";
import Counter from "./conponents/counter";
import Posts from "./conponents/posts";

function App() {
  let posts = [
    {
      key: 1,
      title: "Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции позволяет выполнить важнейшие задания по разработке дальнейших направлений развитая системы массового участия. Не следует, однако, забывать о том, что консультация с профессионалами из IT позволяет оценить значение соответствующих условий активизации. Дорогие друзья, постоянное информационно-техническое обеспечение нашей деятельности требует...",
    },
    {
      key: 2,
      title: "Таким образом, повышение уровня гражданского сознания играет важную роль в формировании направлений прогрессивного развития? Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности позволяет выполнить важнейшие задания по разработке дальнейших направлений развитая системы массового участия. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции играет...",
    },
    {
      key: 3,
      title: "Таким образом, консультация с профессионалами из IT требует от нас системного анализа направлений прогрессивного развития. Таким образом, дальнейшее развитие различных форм деятельности играет важную роль в формировании дальнейших направлений развития проекта. Повседневная практика показывает, что реализация намеченного плана развития позволяет оценить значение модели развития! Практический опыт показывает, что начало повседневной...",
    },
    {
      key: 4,
      title: "Равным образом новая модель организационной деятельности требует от нас системного анализа направлений прогрессивного развития? Не следует, однако, забывать о том, что начало повседневной работы по формированию позиции обеспечивает актуальность дальнейших направлений развития проекта. Дорогие друзья, консультация с профессионалами из IT играет важную роль в формировании всесторонне сбалансированных нововведений. Соображения высшего...",
    },
    {
      key: 5,
      title: "Равным образом сложившаяся структура организации создаёт предпосылки качественно новых шагов для дальнейших направлений развитая системы массового участия? Разнообразный и богатый опыт консультация с профессионалами из IT представляет собой интересный эксперимент проверки всесторонне сбалансированных нововведений? Не следует, однако, забывать о том, что социально-экономическое развитие требует от нас системного анализа соответствующих условий...",
    },
    {
      key: 6,
      title: "Дорогие друзья, повышение уровня гражданского сознания требует определения и уточнения существующих финансовых и административных условий. Дорогие друзья, реализация намеченного плана развития в значительной степени обуславливает создание системы обучения кадров, соответствующей насущным потребностям! Разнообразный и богатый опыт реализация намеченного плана развития напрямую зависит от новых предложений. Соображения высшего порядка, а также...",
    },
    {
      key: 7,
      title: "Практический опыт показывает, что постоянное информационно-техническое обеспечение нашей деятельности способствует повышению актуальности форм воздействия. Практический опыт показывает, что постоянный количественный рост и сфера нашей активности требует от нас системного анализа модели развития. Значимость этих проблем настолько очевидна, что реализация намеченного плана развития влечет за собой процесс внедрения и модернизации системы...",
    },
    {
      key: 8,
      title: "Задача организации, в особенности же новая модель организационной деятельности способствует подготовке и реализации направлений прогрессивного развития. Не следует, однако, забывать о том, что социально-экономическое развитие играет важную роль в формировании направлений прогрессивного развития! Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности позволяет выполнить важнейшие задания по разработке...",
    },
    {
      key: 9,
      title: "Повседневная практика показывает, что консультация с профессионалами из IT в значительной степени обуславливает создание направлений прогрессивного развития. Дорогие друзья, консультация с профессионалами из IT в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач. Равным образом выбранный нами инновационный путь играет важную роль в формировании ключевых компонентов планируемого...",
    },
    {
      key: 10,
      title: "Равным образом курс на социально-ориентированный национальный проект играет важную роль в формировании существующих финансовых и административных условий. Равным образом курс на социально-ориентированный национальный проект позволяет оценить значение новых предложений. Задача организации, в особенности же социально-экономическое развитие обеспечивает актуальность направлений прогрессивного развития. Повседневная практика показывает, что сложившаяся структура организации играет важную...",
    },
  ];
  return (
    <div className="box">
      <Counter />
      <ButtonHello />
      <div className="posts__container"> 
        {posts.length && posts.map(post =>{
       return  <Posts key = {post.key} text = {post.title} />
        })}
      </div>
    </div>
  );
}

export default App;
